// Беремо вибірку з минулої лаби:
const x = [24, 27, 28, 26, 24, 25, 24, 23, 22, 28, 28, 24, 24, 22, 24, 26, 28, 25, 23, 24, 22, 25, 26, 25, 26, 25, 24,
  24, 25, 21, 26, 28, 22, 26, 23, 24, 24, 23, 25, 27, 25, 22, 29, 25, 27, 24, 24, 23, 27, 25, 28, 25, 24, 27, 24, 28,
  26, 26, 25, 26, 23, 26, 25, 25, 27, 26, 23, 28, 26, 28, 26, 25, 23, 23, 26, 25, 25, 26, 27, 24, 28, 25, 25, 24, 25,
  25, 28, 22, 24, 25, 28, 27, 30, 24, 22, 27, 25, 25, 25, 27, 27, 24, 23, 26, 21, 23, 24, 28, 23, 22, 22, 24, 28, 27,
  26, 24, 23, 25, 25, 26, 24, 26, 27, 24, 26, 24, 24, 26, 23, 26, 28, 25, 25, 25, 28, 26, 29, 25, 26, 25, 25, 26, 25,
  26, 25, 26, 22, 26];

// Вибірка рівнів довіри
const aArray = [0.2, 0.5, 0.8, 0.9, 0.95, 0.98, 0.99, 0.995, 0.998, 0.999];

//Створюємо масиви з меншим числом обсягом вибірки (зменшуємо масив кожного разу вдвічі, округлюючи до меншого).
//Отримаємо вибірки обягом 74, 37, 18, 9, 4, 2
const x2 = x.slice(0, Math.floor(x.length / 2)); 
const x3 = x.slice(0, Math.floor(x2.length / 2));
const x4 = x.slice(0, Math.floor(x3.length / 2));
const x5 = x.slice(0, Math.floor(x4.length / 2));
const x6 = x.slice(0, Math.floor(x5.length / 2));
const x7 = x.slice(0, Math.floor(x6.length / 2));
const xArray = [x, x2, x3, x4, x5, x6, x7];

export { x, aArray, xArray };